This notebook is created for brief exploration of data set 3 for assignment 2

import packages

In [2]:
import pandas as pd
import numpy as np

Read in data as dataframe

In [3]:
data = pd.read_csv(r"C:\Users\HP1000\Downloads\Participant-03.csv")
data

                 Start            Finish  Steps (count)
0     31/12/2021 23:00   01/01/2022 0:00       0.000000
1      01/01/2022 0:00   01/01/2022 1:00      14.000000
2      01/01/2022 1:00   01/01/2022 2:00       0.000000
3      01/01/2022 2:00   01/01/2022 3:00       0.000000
4      01/01/2022 3:00   01/01/2022 4:00       0.000000
...                ...               ...            ...
6015  08/09/2022 13:00  08/09/2022 14:00       0.000000
6016  08/09/2022 14:00  08/09/2022 15:00     893.959035
6017  08/09/2022 15:00  08/09/2022 16:00     534.040965
6018  08/09/2022 16:00  08/09/2022 17:00     390.020268
6019  08/09/2022 17:00  08/09/2022 18:00    1191.979732

[6020 rows x 3 columns]

Initial data analysis

In [4]:
data.head()

              Start           Finish  Steps (count)
0  31/12/2021 23:00  01/01/2022 0:00            0.0
1   01/01/2022 0:00  01/01/2022 1:00           14.0
2   01/01/2022 1:00  01/01/2022 2:00            0.0
3   01/01/2022 2:00  01/01/2022 3:00            0.0
4   01/01/2022 3:00  01/01/2022 4:00            0.0

read first 5 lines of the data.

Data cleaning

In [5]:
data.dropna()
data

                 Start            Finish  Steps (count)
0     31/12/2021 23:00   01/01/2022 0:00       0.000000
1      01/01/2022 0:00   01/01/2022 1:00      14.000000
2      01/01/2022 1:00   01/01/2022 2:00       0.000000
3      01/01/2022 2:00   01/01/2022 3:00       0.000000
4      01/01/2022 3:00   01/01/2022 4:00       0.000000
...                ...               ...            ...
6015  08/09/2022 13:00  08/09/2022 14:00       0.000000
6016  08/09/2022 14:00  08/09/2022 15:00     893.959035
6017  08/09/2022 15:00  08/09/2022 16:00     534.040965
6018  08/09/2022 16:00  08/09/2022 17:00     390.020268
6019  08/09/2022 17:00  08/09/2022 18:00    1191.979732

[6020 rows x 3 columns]

In [9]:
num = data['Steps (count)'][data['Steps (count)']<0].count()
print("Data frame inconsistences number:" + str(num))

Data frame inconsistences number:0

Check if there is any inconsistence number.The outcome shows there is none.

The data frame has same decimal places, so we do not need to edit them.